[
    {
        "id": 1,
        "name": "GoalMaster Convention",
        "image": "goalmaster.jpg",
        "price": 199.99,
        "short_desc": "Join the gaming elite at the GoalMaster Convention, where champions are made and records are broken. Immerse yourself in a world of virtual soccer glory, where you can meet top players, participate in tournaments, and witness the latest in sports gaming technology. Whether you're a seasoned pro or a casual gamer, GoalMaster Convention has something for everyone.",
        "long_desc": "Welcome to the GoalMaster Convention, the ultimate gathering for soccer gaming enthusiasts from around the world. At GoalMaster, we celebrate the passion for virtual soccer and provide an immersive experience like no other. Our convention is not just an event; it's a pilgrimage for gamers who live and breathe soccer in the digital realm.\n\nDive into the world of virtual goals, where your skills and tactics will be put to the test. From FIFA to Pro Evolution Soccer, we've got it all covered. Meet legendary virtual soccer players, learn their secrets, and challenge them in epic showdowns that will leave you breathless.\n\nThe GoalMaster Convention is not just about gaming; it's about community. Connect with fellow soccer fans, form teams, and make friends for life. Share your strategies, discuss the latest game updates, and cheer for your favorite players in electrifying tournaments.\n\nRequirements to Join:\n- A passion for soccer gaming\n- Your gaming gear (bring your controller!)\n- Enthusiasm to meet and compete with fellow gamers\n",
        "place": "Barcelona"
    },
    {
        "id": 2,
        "name": "Winner Winner Expo",
        "image": "winnerwinner.jpg",
        "price": 249.99,
        "short_desc": "Experience the thrill of victory at the Winner Winner Expo, the ultimate gathering for competitive gamers. Battle it out in epic showdowns, explore cutting-edge gaming gear, and connect with fellow champions from around the world. Whether you're into battle royales, eSports, or classic arcade games, Winner Winner Expo is your chance to claim the top spot on the leaderboard.",
        "long_desc": "Welcome to the Winner Winner Expo, where the taste of victory is sweeter than ever. If you're a competitive gamer seeking adrenaline-pumping action, this is your domain. Winner Winner Expo is not for the faint of heart; it's for those who thrive under pressure and live for the thrill of victory.\n\nImmerse yourself in a world of intense competition, where every move counts. From battle royales like Fortnite and Apex Legends to the high-stakes world of eSports, you'll find it all at Winner Winner Expo. Battle against the best and prove your skills in front of a global audience.\n\nBut it's not all about competition. Winner Winner Expo is also a hub for innovation in gaming. Explore the latest gaming gear, from cutting-edge peripherals to high-performance PCs. Meet industry experts, get a sneak peek at upcoming releases, and take your gaming setup to the next level.\n\nRequirements to Join:\n- Competitive spirit and determination\n- Gaming gear and peripherals\n- Willingness to engage in high-stakes competition\n",
        "place": "Las Vegas"
    },
    {
        "id": 3,
        "name": "MotoGP Main Fest",
        "image": "motogp.jpg",
        "price": 179.99,
        "short_desc": "Rev up your engines and get ready for high-octane excitement at the MotoGP Main Fest. This adrenaline-fueled gaming convention is a paradise for motorcycle racing enthusiasts. Test your skills on virtual tracks, meet legendary riders, and explore the latest in racing simulation technology. MotoGP Main Fest is where the spirit of MotoGP comes to life.",
        "long_desc": "Welcome to the MotoGP Main Fest, where the world of motorcycle racing meets gaming in an electrifying fusion. Whether you're a die-hard MotoGP fan or an adrenaline junkie, this is the event for you. MotoGP Main Fest is all about the thrill of two-wheeled racing, and we bring it to the digital realm.\n\nGet ready to experience the roar of virtual engines as you compete on iconic tracks from around the world. Challenge yourself against the best riders in the virtual MotoGP world and prove that you have what it takes to dominate the track.\n\nBut that's not all. MotoGP Main Fest is your opportunity to meet legendary riders in person. Get up close and personal with MotoGP champions, hear their stories, and take part in autograph sessions that will leave you starstruck.\n\nRequirements to Join:\n- Passion for motorcycle racing\n- Virtual racing gear and controllers\n- A need for speed and a thirst for competition\n",
        "place": "Valencia"
    },
    {
        "id": 4,
        "name": "Racing Rivals Expo",
        "image": "racingrivals.jpg",
        "price": 229.99,
        "short_desc": "Get behind the wheel and compete against the best at the Racing Rivals Expo. This convention is a haven for racing game enthusiasts, offering the latest in racing simulators, esports competitions, and opportunities to meet professional racers. Whether you prefer Formula 1, rally racing, or street racing, Racing Rivals Expo has it all under one roof.",
        "long_desc": "Welcome to the Racing Rivals Expo, where the world of racing comes to life in the gaming universe. If you're a racing enthusiast, this is your chance to experience the thrill of high-speed competition, explore cutting-edge racing technology, and connect with fellow speed demons.\n\nTest your racing skills on some of the most challenging virtual tracks, from Formula 1 circuits to off-road rally races. Compete against other gamers, experience the rush of esports competitions, and showcase your expertise in front of a passionate racing community.\n\nBut it's not just about the virtual world. Racing Rivals Expo brings you face-to-face with real-world racing legends. Meet professional racers, hear their stories, and gain insights into the world of motorsports.\n\nRequirements to Join:\n- A love for all things racing\n- Racing gaming gear and peripherals\n- A need for speed and a competitive spirit\n",
        "place": "Indianapolis"
    },
    {
        "id": 5,
        "name": "COD Warzone Rumble",
        "image": "codwarzone.jpg",
        "price": 279.99,
        "short_desc": "Gear up for intense warfare at the COD Warzone Rumble, the ultimate Call of Duty convention. Dive into the action-packed world of Warzone, meet your favorite streamers and pro players, and test your skills in epic battles. With the latest game updates and exclusive content, COD Warzone Rumble is a must-attend event for any Call of Duty fan.",
        "long_desc": "Welcome to the COD Warzone Rumble, where the battlefield comes alive in the gaming universe. If you're a fan of Call of Duty and the heart-pounding action of Warzone, this convention is your battleground. COD Warzone Rumble is all about tactical warfare, intense battles, and rising to the challenge.\n\nPrepare for epic showdowns as you face off against other Warzone warriors. Meet your favorite streamers, engage with pro players, and get a chance to play alongside the best in the business. Experience the latest game updates and exclusive content that will keep you on the edge of your seat.\n\nBut it's not just about the game; it's about the community. Connect with fellow COD enthusiasts, share strategies, and discuss your favorite loadouts. Whether you're a seasoned veteran or a newcomer, there's a place for you at COD Warzone Rumble.\n\nRequirements to Join:\n- A love for Call of Duty\n- Gaming gear and controllers\n- Tactical mindset and teamwork\n",
        "place": "Los Angeles"
    },
    {
        "id": 6,
        "name": "PUBG Mobile Mania",
        "image": "pubgmobile.jpg",
        "price": 199.99,
        "short_desc": "Drop into the battlegrounds at PUBG Mobile Mania, where mobile gaming meets intense battle royale action. Immerse yourself in the world of PUBG, join squads, and compete for glory. From strategy sessions to cosplay contests, PUBG Mobile Mania is the ultimate gathering for PUBG enthusiasts. Get ready to jump, loot, and survive!",
        "long_desc": "Welcome to the battlegrounds of PUBG Mobile Mania, where the thrill of battle royale takes center stage. If you're a PUBG fanatic and a mobile gaming enthusiast, this convention is your virtual battlefield. PUBG Mobile Mania brings together players from around the globe for intense, heart-pounding action.\n\nDrop into the iconic PUBG maps and form squads with fellow gamers. Battle it out for supremacy, strategize with your team, and aim for victory. From looting to surviving, every moment is an adrenaline rush.\n\nBut it's not just about the battles. PUBG Mobile Mania is a celebration of the game's community. Join strategy sessions, learn from pro players, and participate in thrilling cosplay contests. Whether you're a lone wolf or a squad leader, there's a place for you in the world of PUBG Mobile Mania.\n\nRequirements to Join:\n- A passion for PUBG\n- Mobile gaming devices\n- Team spirit and survival instincts\n",
        "place": "Seoul"
    }
]